app/Controllers/BaseController.php

SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-05'
 LIMIT 1
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        // ✅ WAJIB: aktifkan session service
        $this->session = \Config\Services::session();

        // ✅ Set diskon harian ke session jika tanggal cocok
        $diskonModel = new DiskonModel();
        $diskonHariIni = $diskonModel->where('tanggal', date('Y-m-d'))->first();