app/Controllers/DiskonController.php

SELECT *
FROM `diskon`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        if (session()->get('role') != 'admin') {
            return redirect()->to('/home');
        }

        $data['diskon'] = $this->diskonModel->orderBy('tanggal', 'DESC')->findAll();

SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-04'
 LIMIT 1
INSERT INTO `diskon` (`tanggal`, `nominal`, `created_at`, `updated_at`) VALUES ('2025-07-04', '300000', '2025-07-04 15:55:41', '2025-07-04 15:55:41')
---
   public function store()
{
    $tanggal = $this->request->getPost('tanggal');

    // Cek apakah diskon untuk tanggal ini sudah ada
    $existing = $this->diskonModel->where('tanggal', $tanggal)->first();
    if ($existing) {
        return redirect()->back()->withInput()->with('error', 'Diskon untuk tanggal ini sudah ada.');
    }

    // Simpan diskon baru
    $this->diskonModel->save([
        'tanggal'    => $tanggal,
        'nominal'    => $this->request->getPost('nominal'),
        'created_at' => date('Y-m-d H:i:s'),
        'updated_at' => date('Y-m-d H:i:s'),
    ]);

DELETE FROM `diskon`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        $this->diskonModel->delete($id);