app/Controllers/TransaksiController.php

public function buy()
{
    if ($this->request->getPost()) {
        $dataForm = [
            'username'    => $this->request->getPost('username'),
            'total_harga' => $this->request->getPost('total_harga'),
            'alamat'      => $this->request->getPost('alamat'),
            'ongkir'      => $this->request->getPost('ongkir'),
            'status'      => 0,
            'created_at'  => date("Y-m-d H:i:s"),
            'updated_at'  => date("Y-m-d H:i:s")
        ];

        $this->transaction->insert($dataForm);
        $transaksi_id = $this->transaction->getInsertID(); // ✅ gunakan nama yang konsisten

        foreach ($this->cart->contents() as $item) {
            $this->transaction_detail->insert([
                'transaction_id'   => $transaksi_id,
                'product_id'       => $item['id'],
                'jumlah'           => $item['qty'],
                'diskon'           => session('diskon') ?? 0,
                'subtotal_harga'   => $item['subtotal'],
                'created_at'       => date('Y-m-d H:i:s'),
                'updated_at'       => date('Y-m-d H:i:s')
            ]);
---
INSERT INTO `transaction` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_at`, `updated_at`) VALUES ('restu.sitompul', '20100000', 'ajibarang secang', '300000', 0, '2025-07-05 00:20:11', '2025-07-05 00:20:11')
INSERT INTO `transaction_detail` (`transaction_id`, `product_id`, `jumlah`, `diskon`, `subtotal_harga`, `created_at`, `updated_at`) VALUES (11, '4', 1, '200000', 19800000, '2025-07-05 00:20:11', '2025-07-05 00:20:11')