app/Models/DiskonModel.php

    public function getTodayDiskon()
    {
        return $this->where('tanggal', date('Y-m-d'))->first();
---
SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-05'
 LIMIT 1